## Production: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                          NAME                                                          |
|--------|------------------------------------------------------------------------------------------------------------------------|
| add    | `module.lambda_no_log_detection[0].aws_cloudwatch_metric_alarm.empty_log_group_metric_alarm[&quot;/aws/lambda/api-lambda&quot;]` |
| delete | `module.lambda_no_log_detection.aws_cloudwatch_metric_alarm.empty_log_group_metric_alarm[&quot;/aws/lambda/api-lambda&quot;]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_api_gateway_account.api_cloudwatch has moved to aws_api_gateway_account.api_cloudwatch[0]
    resource "aws_api_gateway_account" "api_cloudwatch" {
        id                  = "api-gateway-account"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.api-lambda has moved to aws_cloudwatch_dashboard.api-lambda[0]
    resource "aws_cloudwatch_dashboard" "api-lambda" {
        id             = "API-Lambda"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.api_lambda_log_group has moved to aws_cloudwatch_log_group.api_lambda_log_group[0]
    resource "aws_cloudwatch_log_group" "api_lambda_log_group" {
        id                = "/aws/lambda/api-lambda"
        name              = "/aws/lambda/api-lambda"
        tags              = {
            "Application" = "lambda"
            "CostCenter"  = "notification-canada-ca-production"
            "Environment" = "production"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_metric_filter.errors-lambda-api has moved to aws_cloudwatch_log_metric_filter.errors-lambda-api[0]
    resource "aws_cloudwatch_log_metric_filter" "errors-lambda-api" {
        id             = "errors-lambda-api"
        name           = "errors-lambda-api"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.errors-salesforce-api has moved to aws_cloudwatch_log_metric_filter.errors-salesforce-api[0]
    resource "aws_cloudwatch_log_metric_filter" "errors-salesforce-api" {
        id             = "errors-salesforce-api"
        name           = "errors-salesforce-api"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api has moved to aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]
    resource "aws_cloudwatch_metric_alarm" "logs-1-error-1-minute-warning-lambda-api" {
        id                        = "logs-1-error-1-minute-warning-lambda-api"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api has moved to aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]
    resource "aws_cloudwatch_metric_alarm" "logs-1-error-1-minute-warning-salesforce-api" {
        id                        = "logs-1-error-1-minute-warning-salesforce-api"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api has moved to aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]
    resource "aws_cloudwatch_metric_alarm" "logs-10-error-5-minutes-critical-lambda-api" {
        id                        = "logs-10-error-5-minutes-critical-lambda-api"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.api-lambda-errors has moved to aws_cloudwatch_query_definition.api-lambda-errors[0]
    resource "aws_cloudwatch_query_definition" "api-lambda-errors" {
        id                  = "f7258c1a-91b2-4ca8-8389-4233f57f9a0b"
        name                = "API lambda - errors"
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.api_cloudwatch has moved to aws_iam_role.api_cloudwatch[0]
    resource "aws_iam_role" "api_cloudwatch" {
        id                    = "ApiGatewayCloudWatchRole"
        name                  = "ApiGatewayCloudWatchRole"
        tags                  = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy_attachment.api_cloudwatch has moved to aws_iam_role_policy_attachment.api_cloudwatch[0]
    resource "aws_iam_role_policy_attachment" "api_cloudwatch" {
        id         = "ApiGatewayCloudWatchRole-20211022140259126300000001"
        # (2 unchanged attributes hidden)
    }

  # module.lambda_no_log_detection.aws_cloudwatch_metric_alarm.empty_log_group_metric_alarm["/aws/lambda/api-lambda"] will be destroyed
  # (because module.lambda_no_log_detection is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "empty_log_group_metric_alarm" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> null
      - alarm_description         = "Alarm when there are no incoming log events for 10 minutes" -> null
      - alarm_name                = "Empty log group alarm: /aws/lambda/api-lambda" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:Empty log group alarm: /aws/lambda/api-lambda" -> null
      - comparison_operator       = "LessThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "Empty log group alarm: /aws/lambda/api-lambda" -> null
      - insufficient_data_actions = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> null
      - metric_name               = "IncomingLogEvents" -> null
      - namespace                 = "AWS/Logs" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> null
      - period                    = 600 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "breaching" -> null
    }

  # module.lambda_no_log_detection[0].aws_cloudwatch_metric_alarm.empty_log_group_metric_alarm["/aws/lambda/api-lambda"] will be created
  + resource "aws_cloudwatch_metric_alarm" "empty_log_group_metric_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Alarm when there are no incoming log events for 10 minutes"
      + alarm_name                            = "Empty log group alarm: /aws/lambda/api-lambda"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "IncomingLogEvents"
      + namespace                             = "AWS/Logs"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 600
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "breaching"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.api_lambda,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "api_lambda":
   1: resource "aws_wafv2_web_acl" "api_lambda" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.lambda_no_log_detection[0].aws_cloudwatch_metric_alarm.empty_log_group_metric_alarm[\"/aws/lambda/api-lambda\"]"]

37 tests, 17 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
